# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 3  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs
fusion_mode: bifpn
node_mode: C3k2_WTConv
head_channel: 256

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, ContextGuidedBlock_Down, [128]] # 1-P2/4
  - [-1, 2, C3k2_WTConv, [256, False, 0.25]]
  - [-1, 1, ContextGuidedBlock_Down, [256]] # 3-P3/8
  - [-1, 2, C3k2_WTConv, [512, False, 0.25]]
  - [-1, 1, ContextGuidedBlock_Down, [512]] # 5-P4/16
  - [-1, 2, C3k2_WTConv, [512, True]]
  - [-1, 1, ContextGuidedBlock_Down, [1024]] # 7-P5/32
  - [-1, 2, C3k2_WTConv, [1024, True]]
  - [-1, 1, SPPFSENetV2, [1024, 5]] # 9
  - [-1, 2, C2PSA_SENetV2, [1024]] # 10

# YOLOv8.0n head
head:
  - [4, 1, Conv, [head_channel]]  # 10-P3/8
  - [6, 1, Conv, [head_channel]]  # 11-P4/16
  - [9, 1, Conv, [head_channel]]  # 12-P5/32

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13 P5->P4
  - [[-1, 12], 1, Fusion, [fusion_mode]] # 14
  - [-1, 3, node_mode, [head_channel]] # 15-P4/16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 16 P4->P3
  - [[-1, 11], 1, Fusion, [fusion_mode]] # 17
  - [-1, 3, node_mode, [head_channel]] # 18-P3/8

  - [2, 1, Conv, [head_channel, 3, 2]] # 19 P2->P3
  - [[-1, 11, 19], 1, Fusion, [fusion_mode]] # 20
  - [-1, 3, node_mode, [head_channel]] # 21-P3/8

  - [-1, 1, Conv, [head_channel, 3, 2]] # 22 P3->P4
  - [[-1, 12, 16], 1, Fusion, [fusion_mode]] # 23
  - [-1, 3, node_mode, [head_channel]] # 24-P4/16

  - [-1, 1, Conv, [head_channel, 3, 2]] # 25 P4->P5
  - [[-1, 13], 1, Fusion, [fusion_mode]] # 26
  - [-1, 3, node_mode, [head_channel]] # 27-P5/32

  - [[22, 25, 28], 1, Detect, [nc]]  # Detect(P3, P4, P5)